STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXEncoder.cpp
/*
 * Copyright (C) Texas Instruments - http://www.ti.com/
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2.1 of the License, or (at your option) any later version.
 *
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA
 */

#include "VTCLoopback.h"
#include "IOMXEncoder.h"
#define LOG_TAG "VTC_ENC"
#define LOG_NDEBUG 0
//#define NO_MEMCOPY 1
#define MY_LOGV(x, ...) LOGV(x, ##__VA_ARGS__)

using namespace android;

static void PrintEncoderFPS() {
    static int mFrameCount = 0;
    static int mLastFrameCount = 0;
    static nsecs_t mLastFpsTime = 0;
    static float mFps = 0;
    mFrameCount++;
    if (!(mFrameCount & 0x1F)) {
        nsecs_t now = systemTime();
        nsecs_t diff = now - mLastFpsTime;
        mFps = ((mFrameCount - mLastFrameCount) * float(s2ns(1))) / diff;
        mLastFpsTime = now;
        mLastFrameCount = mFrameCount;
        LOGD("Encoder: %d Frames, %f FPS", mFrameCount, mFps);
    }
    // XXX: mFPS has the value we want
}

static void PrintEncoderLatency(nsecs_t ts) {
    static int mFrameCount = 0;
    static int64_t sum_latency_ms = 0;
    int64_t now, diff_ms, avg_latency;

    now = systemTime()/1000;
    diff_ms = (now - ts) / 1000;
    sum_latency_ms += diff_ms;
    mFrameCount++;
    if (!(mFrameCount & 0x1F)) {
        avg_latency = sum_latency_ms / 32;
        sum_latency_ms = 0;
        LOGD("Avg Encoder Latency: %d Frames, %llu ms", mFrameCount, avg_latency);
    }
}

static uint64_t get_time_of_day_ms() {
    struct timeval t0;
    gettimeofday(&t0,0);
    return t0.tv_sec*1000 + t0.tv_usec/1000;
}

static void PrintEffectiveBitrate(OMX_U32 filledLen) {
    static int framecount = 0;
    static uint64_t bytecount = 0;
    static uint64_t starttime = get_time_of_day_ms();
    const uint64_t wallclock = get_time_of_day_ms();
    framecount++;
    bytecount+=filledLen;
    int delta=wallclock-starttime;
    if (delta>2000) {
        int fps=framecount*10000/delta;
        const uint64_t br=bytecount*8*1000/delta;
        //LOGI("ENCODER FPS: %d.%d",fps/10,fps-(fps/10)*10);
        LOGI("ENCODER EFFECTIVE BITRATE: %llu",br);
        framecount=0;
        bytecount=0;
        starttime = wallclock;
    }
}


bool OMXEncoder::OMXCallbackHandler::Handler() {
    MY_LOGV("\n OMXCallbackHandler::Handler \n");
    Ti::Utils::Message msg;
    volatile int forever = 1;

    while(forever) {
        Ti::Utils::MessageQueue::waitForMsg(&mCommandMsgQ, NULL, NULL, -1);
        {
            Mutex::Autolock lock(mLock);
            mCommandMsgQ.get(&msg);
        }

        switch ( msg.command ) {
            case OMXCallbackHandler::COMMAND_PROCESS_MSG: {
                omx_message *om = (omx_message*)(msg.arg1);
                omx_message omsg = *om;
                mOMXEncoder->on_message(omsg);
                break;
            }
            case OMXCallbackHandler::COMMAND_EXIT: {
                LOGD("Exiting OMX callback handler");
                forever = 0;
                break;
            }
        }
    }

    return false;
}

OMXEncoder::OMXEncoder(const sp<IOMX> &omx, IOMX::node_id node, sp<MyCameraClient> camera, int width, int height, int framerate, int bitrate, char *fname, int sliceHeight):
    mOMX(omx),
    mNode(node),
    mCameraSource(camera) {
    resetParameters(width, height, framerate, bitrate, fname, sliceHeight);
}


OMXEncoder::~OMXEncoder() {
    status_t err = mOMX->freeNode(mNode);
    CHECK_EQ(err, (status_t)OK);
    LOGD("OMX_FreeHandle completed");
}

status_t OMXEncoder::resetParameters(int width, int height, int framerate, int bitrate, char *fname, int sliceHeight) {
    mWidth = width;
    mHeight = height;
    mFrameRate= framerate;
    mBitRate = bitrate;
    mSliceHeight = sliceHeight;
    mAcceptingBuffers = 0;
    mOutputFD = NULL;
    mBufferCount = 0;
    mOutputBufferCount = 4;
    mCallbackSet = false;
    mState = OMX_StateLoaded;
    return OK;
}

void OMXEncoder::on_message(const omx_message &msg) {
    switch (msg.type) {
        case omx_message::EVENT:
            EventHandler(msg.u.event_data.event, msg.u.event_data.data1, msg.u.event_data.data2);
            break;
        case omx_message::EMPTY_BUFFER_DONE:
            EmptyBufferDone((OMX_BUFFERHEADERTYPE*)msg.u.extended_buffer_data.buffer);
            break;
        case omx_message::FILL_BUFFER_DONE:
            FillBufferDone((OMX_BUFFERHEADERTYPE*)msg.u.extended_buffer_data.buffer,
                    msg.u.extended_buffer_data.range_offset,
                    msg.u.extended_buffer_data.range_length,
                    msg.u.extended_buffer_data.timestamp);
            break;
        default:
            CHECK(!"############ Corrupted Message !!! #############");
            break;
    }
}

status_t OMXEncoder::configure(OMX_VIDEO_AVCPROFILETYPE profile, OMX_VIDEO_AVCLEVELTYPE level, OMX_U32 refFrames) {
    status_t err;
    LOG_FUNCTION_NAME_ENTRY

    MY_LOGV("\n\nPROFILE=%d\nLEVEL=%d\nRefFrames=%d\nWidth=%d\nHeight=%d\nFramerate=%d\nBitrate=%d\nSliceHeight=%d\n\n",
            profile, level, refFrames, mWidth, mHeight, mFrameRate, mBitRate, mSliceHeight);

    if ((mCallbackSet == false) && ((mDebugFlags & ENCODER_NO_FILE_WRTIE) == 0)) {
        mOutputFD = fopen("/mnt/sdcard/video_0.264","w");
        if (mOutputFD == NULL) {
            LOGE("\n fopen failed\n");
        }
        LOGD("\nCallback was NULL. Opened file for writing\n");
    }

    // initialize omx callback handling thread
    if(mOMXCallbackHandler.get() == NULL) {
        mOMXCallbackHandler = new OMXCallbackHandler(this);
    }

    if ( NULL == mOMXCallbackHandler.get() ) {
        LOGE("Couldn't create omx callback handler");
        return -1;
    }

    err = mOMXCallbackHandler->run("OMXCallbackThread", PRIORITY_URGENT_DISPLAY);
    if ( err != NO_ERROR ) {
        if( err == INVALID_OPERATION) {
            LOGE("omx callback handler thread already runnning!!");
            err = NO_ERROR;
        } else {
            LOGE("Couldn't run omx callback handler thread");
            return -1;
        }
    }

    mState = OMX_StateLoaded;

    OMX_VIDEO_PARAM_PORTFORMATTYPE format;
    INIT_OMX_STRUCT(&format, OMX_VIDEO_PARAM_PORTFORMATTYPE);
    format.nPortIndex = INPUT_PORT;
    format.nIndex = 0;
    bool found = false;
    OMX_U32 index = 0;
    for (;;) {
        format.nIndex = index;
        err = mOMX->getParameter(mNode, OMX_IndexParamVideoPortFormat, &format, sizeof(format));
        if (err != OK) {
            LOGD( "get OMX_IndexParamVideoPortFormat InPort Error:0x%x. OMX_ErrorUnsupportedIndex=0x%x", err, OMX_ErrorUnsupportedIndex);
            return -1;
        }

        if (format.eCompressionFormat == OMX_VIDEO_CodingUnused
                && format.eColorFormat == (OMX_COLOR_FORMATTYPE)OMX_TI_COLOR_FormatYUV420PackedSemiPlanar) {
            found = true;
            break;
        }
        ++index;
    }

