STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXEncoder.cpp
    if (!found) {
        LOGE("Did not find a match.");
        return -1;
    }

    MY_LOGV("found a match.");
    err = mOMX->setParameter(mNode, OMX_IndexParamVideoPortFormat, &format, sizeof(format));
    if (err != OK) {
        LOGD( "set OMX_IndexParamVideoPortFormat InPort Error:%d", err);
        return -1;
    }

    format.nPortIndex = OUTPUT_PORT;
    format.nIndex = 0;
    found = false;
    index = 0;
    for (;;) {
        format.nIndex = index;
        err = mOMX->getParameter(mNode, OMX_IndexParamVideoPortFormat, &format, sizeof(format));
        if (err != OK) {
            LOGD( "get OMX_IndexParamVideoPortFormat OutPort Error:%d", err);
            return -1;
        }

        if (format.eCompressionFormat == OMX_VIDEO_CodingAVC
                && format.eColorFormat == (OMX_COLOR_FormatUnused)) {
            found = true;
            break;
        }
        ++index;
    }

    if (!found) {
        LOGE("Did not find a match.");
        return -1;
    }

    MY_LOGV("found a match.");
    err = mOMX->setParameter(mNode, OMX_IndexParamVideoPortFormat, &format, sizeof(format));
    if (err != OK) {
        LOGD( "set OMX_IndexParamVideoPortFormat OutPort Error:%d", err);
        return -1;
    }

    //
    // Populate Video input Port
    //
    INIT_OMX_STRUCT(&tInPortDef, OMX_PARAM_PORTDEFINITIONTYPE);

    tInPortDef.nPortIndex = INPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD( "get OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    tInPortDef.format.video.nFrameWidth = mWidth;
    tInPortDef.format.video.nFrameHeight = mHeight;
    tInPortDef.format.video.nStride = 4096;
    tInPortDef.format.video.nSliceHeight = mHeight;
    tInPortDef.format.video.xFramerate = (mFrameRate << 16);
    tInPortDef.format.video.eCompressionFormat = OMX_VIDEO_CodingUnused;
    tInPortDef.format.video.eColorFormat = (OMX_COLOR_FORMATTYPE)OMX_TI_COLOR_FormatYUV420PackedSemiPlanar;
    tInPortDef.nBufferSize = (mWidth * mHeight *3)/2;
    err = mOMX->setParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD( "set OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    //
    // Populate Video output Port
    //
    INIT_OMX_STRUCT(&tOutPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tOutPortDef.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition,&tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    tOutPortDef.format.video.nFrameWidth = mWidth;
    tOutPortDef.format.video.nFrameHeight = mHeight;
    tOutPortDef.format.video.xFramerate = 0;
    tOutPortDef.format.video.nBitrate = mBitRate;
    tOutPortDef.format.video.eCompressionFormat = OMX_VIDEO_CodingAVC;
    tOutPortDef.format.video.eColorFormat = OMX_COLOR_FormatUnused;
    tOutPortDef.nBufferCountActual = mOutputBufferCount;

    err = mOMX->setParameter(mNode, OMX_IndexParamPortDefinition, &tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD( "set OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition,&tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    //
    // setup (code specific) AVC Encoder paramters for OUTPUT port
    //
    OMX_VIDEO_PARAM_AVCTYPE h264type;
    INIT_OMX_STRUCT(&h264type,OMX_VIDEO_PARAM_AVCTYPE);

    h264type.nPortIndex = OUTPUT_PORT;

    err = mOMX->getParameter(mNode, OMX_IndexParamVideoAvc, &h264type, sizeof(h264type));
    if (err != OK) {
        LOGD("get OMX_IndexParamVideoAvc failed : %d", err);
        return -1;
    }

    h264type.nAllowedPictureTypes = OMX_VIDEO_PictureTypeI | OMX_VIDEO_PictureTypeP;
    h264type.eProfile = profile;
    h264type.eLevel = level;
    h264type.nSliceHeaderSpacing = 0;
    h264type.bUseHadamard = OMX_TRUE;
    h264type.nRefFrames = refFrames;
    h264type.nBFrames = 0;
    //h264type.nPFrames = 30;  // assume iFrameInterval 1, frameRate
    h264type.nPFrames = 0; // Let only the first frame be an I Frame. The rest will be P Frames. For VTC type of applications, you want to insert the IDR only when necessary.
    h264type.nRefIdx10ActiveMinus1 = 0;
    h264type.nRefIdx11ActiveMinus1 = 0;
    h264type.bEntropyCodingCABAC = OMX_FALSE;
    h264type.bWeightedPPrediction = OMX_FALSE;
    h264type.bconstIpred = OMX_FALSE;
    h264type.bDirect8x8Inference = OMX_FALSE;
    h264type.bDirectSpatialTemporal = OMX_FALSE;
    h264type.nCabacInitIdc = 0;
    h264type.bEnableUEP = OMX_FALSE;
    h264type.bEnableFMO = OMX_FALSE;
    h264type.bEnableASO = OMX_FALSE;
    h264type.bEnableRS = OMX_FALSE;
    h264type.bFrameMBsOnly = OMX_TRUE;
    h264type.bMBAFF = OMX_FALSE;
    h264type.eLoopFilterMode = OMX_VIDEO_AVCLoopFilterEnable;

    err = mOMX->setParameter(mNode, OMX_IndexParamVideoAvc, &h264type, sizeof(h264type));
    if (err != OK) {
        LOGD("set OMX_IndexParamVideoAvc failed : %d", err);
        return -1;
    }

    //
    // Set Profile and Level for OUTPUT
    //
    OMX_VIDEO_PARAM_PROFILELEVELTYPE profileLevel;
    INIT_OMX_STRUCT(&profileLevel, OMX_VIDEO_PARAM_PROFILELEVELTYPE);
    profileLevel.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamVideoProfileLevelCurrent, &profileLevel, sizeof(profileLevel));
    if (err != OK) {
        LOGD("get OMX_IndexParamVideoProfileLevelCurrent failed : %d", err);
        return -1;
    }

    profileLevel.eProfile = profile;
    profileLevel.eLevel = level;
    err = mOMX->setParameter(mNode, OMX_IndexParamVideoProfileLevelCurrent, &profileLevel, sizeof(profileLevel));
    if (err != OK) {
        LOGD("set OMX_IndexParamVideoProfileLevelCurrent failed : %d", err);
        return -1;
    }

    //
    // Set data content type for input port
    //
    OMX_TI_VIDEO_PARAM_FRAMEDATACONTENTTYPE dataContent;
    INIT_OMX_STRUCT(&dataContent, OMX_TI_VIDEO_PARAM_FRAMEDATACONTENTTYPE);
    dataContent.nPortIndex = INPUT_PORT;
    err = mOMX->getParameter(mNode, (OMX_INDEXTYPE)OMX_TI_IndexParamVideoFrameDataContentSettings, &dataContent, sizeof(dataContent));
    if (err != OK) {
        LOGD("get OMX_TI_IndexParamVideoFrameDataContentSettings failed : %d", err);
        return -1;
    }

    dataContent.eContentType = OMX_TI_Video_Progressive; //appears to be the default value
    err = mOMX->setParameter(mNode, (OMX_INDEXTYPE)OMX_TI_IndexParamVideoFrameDataContentSettings, &dataContent, sizeof(dataContent));
    if (err != OK) {
        LOGD("set OMX_TI_IndexParamVideoFrameDataContentSettings failed : %d", err);
        return -1;
    }

    //
    // setupBitRate for OUTPUT
    //
    OMX_VIDEO_PARAM_BITRATETYPE bitrateType;
    INIT_OMX_STRUCT(&bitrateType,OMX_VIDEO_PARAM_BITRATETYPE);
    bitrateType.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamVideoBitrate, &bitrateType, sizeof(bitrateType));
    if (err != OK) {
        LOGD("get OMX_IndexParamVideoBitrate failed : %d", err);
        return -1;
    }

    bitrateType.eControlRate = OMX_Video_ControlRateVariable;
    bitrateType.nTargetBitrate = mBitRate;
    err = mOMX->setParameter(mNode, OMX_IndexParamVideoBitrate, &bitrateType, sizeof(bitrateType));
    if (err != OK) {
        LOGD("set OMX_IndexParamVideoBitrate failed : %d", err);
        return -1;
    }

    err = mOMX->storeMetaDataInBuffers(mNode, INPUT_PORT, OMX_TRUE);
    if (err != OK) {
        LOGE("Storing meta data in video buffers is not supported");
        return -1;
    }

