STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXEncoder.cpp
    if (mSliceHeight == 0) {
        LOG_FUNCTION_NAME_EXIT
        return 0;
    }

    /**************** Configuration specific to Slice based processing ******************/

    //
    // setup data sync mode for INPUT
    //
    OMX_VIDEO_PARAM_DATASYNCMODETYPE syncMode;
    INIT_OMX_STRUCT(&syncMode, OMX_VIDEO_PARAM_DATASYNCMODETYPE);
    syncMode.nPortIndex = INPUT_PORT;
    err = mOMX->getParameter(mNode, (OMX_INDEXTYPE)OMX_TI_IndexParamVideoDataSyncMode, &syncMode, sizeof(syncMode));
    if (err != OK) {
        LOGD("get OMX_TI_IndexParamVideoDataSyncMode failed : %d", err);
        return -1;
    }

    syncMode.eDataMode = OMX_Video_NumMBRows;
    err = mOMX->setParameter(mNode, (OMX_INDEXTYPE)OMX_TI_IndexParamVideoDataSyncMode, &syncMode, sizeof(syncMode));
    if (err != OK) {
        LOGD("set OMX_TI_IndexParamVideoDataSyncMode failed: %d", err);
        return -1;
    }

    //
    // setup data sync mode for OUTPUT
    //
    INIT_OMX_STRUCT(&syncMode, OMX_VIDEO_PARAM_DATASYNCMODETYPE);
    syncMode.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, (OMX_INDEXTYPE)OMX_TI_IndexParamVideoDataSyncMode, &syncMode, sizeof(syncMode));
    if (err != OK) {
        LOGD("get OMX_TI_IndexParamVideoDataSyncMode failed : %d", err);
        return -1;
    }

    syncMode.eDataMode = OMX_Video_EntireFrame;
    syncMode.nNumDataUnits = 1;
    err = mOMX->setParameter(mNode, (OMX_INDEXTYPE)OMX_TI_IndexParamVideoDataSyncMode, &syncMode, sizeof(syncMode));
    if (err != OK) {
        LOGD("set OMX_TI_IndexParamVideoDataSyncMode failed: %d", err);
        return -1;
    }

    LOG_FUNCTION_NAME_EXIT
    return 0;
}

status_t OMXEncoder::prepare() {
    status_t err;

    LOG_FUNCTION_NAME_ENTRY

    if (setCurrentState(OMX_StateIdle)) {
        return -1;
    }

    INIT_OMX_STRUCT(&tInPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tInPortDef.nPortIndex = INPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    if (mSliceHeight == 0) { // non tunnel mode

        mDealer[INPUT_PORT] = new MemoryDealer((tInPortDef.nBufferCountActual*tInPortDef.nBufferSize), "RECORD_INPUT");
        for (OMX_U32 i = 0; i < tInPortDef.nBufferCountActual; ++i) {
            mBufferInfo[INPUT_PORT][i].mEncMem= mDealer[INPUT_PORT]->allocate(tInPortDef.nBufferSize);
            CHECK(mBufferInfo[INPUT_PORT][i].mEncMem.get() != NULL);
            err = mOMX->allocateBufferWithBackup(mNode, INPUT_PORT, mBufferInfo[INPUT_PORT][i].mEncMem, (void**)(&(mBufferInfo[INPUT_PORT][i].mBufferHdr)));
            if (err != OK) {
                LOGE("OMX_AllocateBuffer for input port index:%d failed:%d",(int)i,err);
                mBufferInfo[INPUT_PORT][i].mBufferHdr = NULL;
            }
        }
        LOGD( "Allocated %d Input port Buffers. ", (int)tInPortDef.nBufferCountActual);
    }

    INIT_OMX_STRUCT(&tOutPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tOutPortDef.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGE("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

#ifdef NO_MEMCOPY
    err = allocateOutputBuffers();
    if (err != OK) return -1;
#else

    mDealer[OUTPUT_PORT] = new MemoryDealer((tOutPortDef.nBufferCountActual*tOutPortDef.nBufferSize), "RECORD_OUTPUT");
    for (OMX_U32 i = 0; i < tOutPortDef.nBufferCountActual; ++i) {
        mBufferInfo[OUTPUT_PORT][i].mEncMem = mDealer[OUTPUT_PORT]->allocate(tOutPortDef.nBufferSize);
        err = mOMX->allocateBufferWithBackup(mNode, OUTPUT_PORT, mBufferInfo[OUTPUT_PORT][i].mEncMem, (void**)(&(mBufferInfo[OUTPUT_PORT][i].mBufferHdr)));
        if (err != OK) {
            LOGD("OMX_UseBuffer for output port index:%d failed:%d",(int)i,err);
            mBufferInfo[OUTPUT_PORT][i].mBufferHdr = NULL;
            return -1;
        }
    }
#endif

    LOGD( "Allocated %d Output port Buffers. ", (int)tOutPortDef.nBufferCountActual);

    LOG_FUNCTION_NAME_EXIT
    return 0;
}

status_t OMXEncoder::start(MetaData *params) {
    status_t err;

    LOG_FUNCTION_NAME_ENTRY

    // now wait until state becomes idle.
    if (waitForStateSet(OMX_StateIdle)) {
        LOGD("state change to IDLE failed");
        return -1;
    }

    // If we are going to reuse the node, then port enable is a MUST
    // since we are disabling the port during stop

    // now transition to exec
    if (setCurrentState(OMX_StateExecuting)) {
        return -1;
    }

    if (waitForStateSet(OMX_StateExecuting)) {
        LOGD("state change to EXECUTING failed");
        return -1;
    }

    mAcceptingBuffers = 1;  // let OMX callbacks to handle buffers

    INIT_OMX_STRUCT(&tInPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tInPortDef.nPortIndex = INPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    INIT_OMX_STRUCT(&tOutPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tOutPortDef.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    // give output buffers to the OMX
    for (int i=0; i<(int)tOutPortDef.nBufferCountActual; i++) {
        err = mOMX->fillBuffer(mNode, mBufferInfo[OUTPUT_PORT][i].mBufferHdr);
        if (err != OK) {
            LOGD("OMX_FillThisBuffer failed:%d", err);
        } else {
            LOGD("called fillBuffer(%d)",i);
        }
    }

    // call camera encoder_is_ready
    mCameraSource->encoderReady();

    if (mSliceHeight) {
        LOG_FUNCTION_NAME_EXIT
        return 0;
    }

    /************** non tunnel / frame mode ***************/

    // now wait for payload to be available. when it does, call OMX_EmptyThisBuffer
    int64_t time[3];
    sp<IMemory> payload[3];

    // wait until camera returns a frame
    for (int i=0; i<3; i++) {
        payload[i] = mCameraSource->getCameraPayload(time[i]);
    }

    for (int i=0; i<3; i++) {
        mBufferInfo[INPUT_PORT][i].mCamMem = payload[i];
        memcpy((uint8_t *)mBufferInfo[INPUT_PORT][i].mEncMem->pointer(),  payload[i]->pointer(), payload[i]->size());
        err = mOMX->emptyBuffer(mNode, mBufferInfo[INPUT_PORT][i].mBufferHdr, 0, payload[i]->size(),  OMX_BUFFERFLAG_ENDOFFRAME, (OMX_TICKS)time);
        if (err != OK) {
            LOGD("OMX_EmptyThisBuffer failed:%d", err);
        } else {
            LOGD("Called EmptyThisBuffer[%d] ",i);
        }
    }

