STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXEncoder.cpp
    LOG_FUNCTION_NAME_EXIT
    return 0;
}

status_t OMXEncoder::stop() {
    status_t err;

    LOG_FUNCTION_NAME_ENTRY

    // stop mAcceptingBuffers any callbacks
    mAcceptingBuffers = 0;
    mCameraSource->encoderNotReady();

    if (mOutputFD) {
        fclose(mOutputFD);
        mOutputFD = NULL;
    }

    if (mSliceHeight == 0) { // non tunnel mode
        // flush all the buffers since mAcceptingBuffers off they won't be returned.
        err = mOMX->sendCommand(mNode,OMX_CommandFlush, INPUT_PORT);
        if (err != OK) {
            LOGD("OMX_CommandFlush for input port (0) failed:%d", err);
        }
    }

    err = mOMX->sendCommand(mNode,OMX_CommandFlush, OUTPUT_PORT);
    if (err != OK) {
        LOGD("OMX_CommandFlush for output port (1) failed:%d", err);
    }

    // change state to Idle if not already
    if (mState != OMX_StateIdle && mState != OMX_StateLoaded) {
        if (setCurrentState(OMX_StateIdle)) {
            LOGD("OMX_StateIdle failed");
        }

        if (waitForStateSet(OMX_StateIdle)) {
            LOGD("state change to IDLE failed");
        }
    }

    // disable ports
    err = mOMX->sendCommand(mNode, OMX_CommandPortDisable, -1);
    if (err != OK) {
        LOGD("Error in SendCommand()-OMX_CommandPortDisable:");
    } else {
        LOGD("OMX_CommandPortDisable done");
    }

    return 0;
}

status_t OMXEncoder::deinit() {
    status_t err;

    LOG_FUNCTION_NAME_ENTRY

    if (mSliceHeight == 0) { // non tunnel mode
        // free input buffers
        for (int i=0; i<(int)tInPortDef.nBufferCountActual; i++) {
            if (mBufferInfo[INPUT_PORT][i].mBufferHdr) {
                err = mOMX->freeBuffer(mNode, INPUT_PORT, mBufferInfo[INPUT_PORT][i].mBufferHdr);
                if( (err != OK)) {
                    LOGD("Free Buffer for Input Port buffer:%d failed:%d",i,err);
                }
            }
        }
    }

    // free output buffers
    for (int i=0; i <(int)tOutPortDef.nBufferCountActual; i++) {
        if (mBufferInfo[OUTPUT_PORT][i].mBufferHdr) {
            err = mOMX->freeBuffer(mNode,OUTPUT_PORT,mBufferInfo[OUTPUT_PORT][i].mBufferHdr);
            if( (err != OK)) {
                LOGD("Free Buffer for Output Port buffer:%d failed:%d",i,err);
            }
        }
    }

    // change state to Loaded
    if (mState != OMX_StateLoaded) {
        if (setCurrentState(OMX_StateLoaded)) {
            LOGD("OMX_StateLoaded failed");
        }
        if (waitForStateSet(OMX_StateLoaded)) {
            LOGD("state change to LOADED failed");
        }
    } else {
        LOGD("It was already OMX_StateLoaded???");
    }

    usleep(5000);


    //Exit and free ref to callback handling thread
    if ( NULL != mOMXCallbackHandler.get() ) {
        Ti::Utils::Message msg;
        msg.command = OMXCallbackHandler::COMMAND_EXIT;
        //Clear all messages pending first
        mOMXCallbackHandler->clearCommandQ();
        mOMXCallbackHandler->put(&msg);
        mOMXCallbackHandler->requestExitAndWait();
        mOMXCallbackHandler.clear();
    }

    LOG_FUNCTION_NAME_EXIT
    return 0;
}

sp<MetaData> OMXEncoder::getFormat() {
    return NULL;
}

status_t OMXEncoder::read(MediaBuffer **buffer, const ReadOptions *options) {
    return 0;
}


OMX_ERRORTYPE OMXEncoder::EventHandler(OMX_EVENTTYPE eEvent, OMX_U32 nData1,OMX_U32 nData2) {
    OMX_ERRORTYPE errorType;
    MY_LOGV("########## EventHandler: eEvent:0x%x, nData1:%d, nData2:%d, pid=%d", (int)eEvent, (int)nData1, (int)nData2, getpid());

    switch (eEvent) {
        case OMX_EventCmdComplete:
            if (nData1 == OMX_CommandPortDisable) {
                if (nData2 == OMX_DirInput) {
                    LOGD( "Component OMX_EventCmdComplete OMX_CommandPortDisable OMX_DirInput");
                }
                if (nData2 == OMX_DirOutput) {
                    LOGD( "Component OMX_EventCmdComplete OMX_CommandPortDisable OMX_DirOutput");
                }
            } else if (nData1 == OMX_CommandStateSet) {
                LOGD( "Component OMX_EventCmdComplete OMX_CommandStateSet new State:%s",OMXStateName((OMX_STATETYPE)nData2));
                {
                    Mutex::Autolock autoLock(mLock);
                    mState = (OMX_STATETYPE)nData2;
                }
                mAsyncCompletion.signal();

            } else if (nData1 == OMX_CommandFlush) {
                LOGD( "Component OMX_EventCmdComplete OMX_CommandFlush port:%d",(int)nData2);
            } else {
                LOGD( "Component OMX_EventCmdComplete command:%d",(int)nData1);
            }
            break;

        case OMX_EventError:
            errorType = (OMX_ERRORTYPE) nData1;
            LOGD( "\n\n\nComponent OMX_EventError error:%x\n\n\n",errorType);
            break;
        default:
            break;
    }
    MY_LOGV("EXIT EventHandler");
    return errorType;
}

status_t OMXEncoder::FillBufferDone(OMX_BUFFERHEADERTYPE* pBufferHdr, OMX_U32 nOffset, OMX_U32 nFilledLen, OMX_TICKS nTimeStamp) {
    status_t err;
    OMX_U32 i=0;

    // not mAcceptingBuffers, just return, eventually, decoder will stop
    if (mAcceptingBuffers == 0) {
        MY_LOGV( " in non mAcceptingBuffers mode");
        return OMX_ErrorNone;
    }

    for (i = 0; i < tOutPortDef.nBufferCountActual; i++) {
        if (pBufferHdr == mBufferInfo[OUTPUT_PORT][i].mBufferHdr) {
            break;
        }
    }
    if (i == tOutPortDef.nBufferCountActual) {
        LOGE("FillBufferDone returned unknown buffer header! i=%d",(int)i);
        return -1;
    }
    //LOGD( "----- %d ----- ", (int)i);

    if (mDebugFlags & DEBUG_DUMP_ENCODER_TIMESTAMP) LOGD("FBD TS: %lld", nTimeStamp);

    if (mDebugFlags & FPS_ENCODER) PrintEncoderFPS();

    if (mDebugFlags & ENCODER_LATENCY) PrintEncoderLatency(nTimeStamp);

    if (mDebugFlags & ENCODER_EFFECTIVE_BITRATE) PrintEffectiveBitrate(nFilledLen);

    if (mCallbackSet) {
        mEncodedBufferCallback((mBufferInfo[OUTPUT_PORT][i].mEncMem->pointer() + nOffset), nFilledLen, nTimeStamp);
    } else {
        if (mOutputFD != NULL) {
            i = fwrite((unsigned char *)(mBufferInfo[OUTPUT_PORT][i].mEncMem->pointer() + nOffset), 1, nFilledLen, mOutputFD);
            if (i != nFilledLen) {
                LOGD("fwrite failed:%d should have been:%d\n", i, nFilledLen);
                return -1;
            }
            fflush(mOutputFD);
        }
    }

    err = mOMX->fillBuffer(mNode, pBufferHdr);
    if (err != OK) {
        LOGE("OMX_FillThisBuffer failed:%d", err);
    }

