STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXEncoder.cpp
    mBufferCount++;
    MY_LOGV("EXIT FillBufferDone: nOffset: %d, nFilledLen=%d, mBufferCount=%d", nOffset, nFilledLen, mBufferCount);
    return OMX_ErrorNone;
}

status_t OMXEncoder::EmptyBufferDone(OMX_BUFFERHEADERTYPE* pBufferHdr)
{
    status_t err;
    OMX_U32 i=0;
    //MY_LOGV("ENTER EmptyBufferDone");

    // not mAcceptingBuffers, just return, eventually, decoder will stop
    if (mAcceptingBuffers == 0) {
        MY_LOGV( " in non mAcceptingBuffers mode");
        return OMX_ErrorNone;
    }

    for (i = 0; i < tInPortDef.nBufferCountActual; i++) {
        if (pBufferHdr == mBufferInfo[INPUT_PORT][i].mBufferHdr) break;
    }

    if (i == tInPortDef.nBufferCountActual) {
        LOGE("EmptyBufferDone returned unknown buffer header! i=%d",(int)i);
        return -1;
    }

    mCameraSource->releaseBuffer(mBufferInfo[INPUT_PORT][i].mCamMem);

    if (mSliceHeight == 0) { // non tunnel mode

        // now get the next buffer and feed the encoder
        sp<IMemory> payload;
        int64_t time;

        // wait til buffer in the camera
        payload = mCameraSource->getCameraPayload(time);
        if (payload != NULL) {
            mBufferInfo[INPUT_PORT][i].mCamMem = payload;
            memcpy((uint8_t *)mBufferInfo[INPUT_PORT][i].mEncMem->pointer(),  payload->pointer(), payload->size());
            err = mOMX->emptyBuffer(mNode, mBufferInfo[INPUT_PORT][i].mBufferHdr, 0, payload->size(),  OMX_BUFFERFLAG_ENDOFFRAME, time);
            if (err != OK) {
                LOGE("OMX_EmptyThisBuffer failed:%d", err);
            }
        }
    }

    //MY_LOGV("EXIT EmptyBufferDone");
    return err;
}

status_t OMXEncoder::setCurrentState(OMX_STATETYPE newState) {
    MY_LOGV("Attempting to set state to %s.", OMXStateName(newState));

    status_t err = mOMX->sendCommand(mNode, OMX_CommandStateSet, newState);
    if (err != OK) {
        LOGD("setCurrentState: Error:%d", err);
        return -1;
    }

    LOG_FUNCTION_NAME_EXIT
    return 0;
}

status_t OMXEncoder::waitForStateSet(OMX_STATETYPE newState) {
    MY_LOGV("waitForStateSet: Waiting to move to state %s .....", OMXStateName(newState));

    if (newState == mState) {
        LOGD("New State [%s] already set!", OMXStateName(newState));
        return 0;
    }

    status_t retval = mAsyncCompletion.waitRelative(mLock, TWO_SECOND);
    if (retval) {
        if (errno == ETIMEDOUT) {
            LOGD("$$$$$$$$$$$$$$$$$$$$$$$$$$$$ Waiting for State change timed out $$$$$$$$$$$$$$$$$$$$$$$$$$$$");
        } else {
            LOGD("$$$$$$$$$$$$$$$$$$$$$$$$$$$$ Waiting for State errno :%d, retval:%d \n", errno, retval);
        }
    }

    if (newState == mState) {
        LOGD("State [%s] Set !!!!!!!!!!!!!!!!!", OMXStateName(newState));
        return 0;
    }

    LOG_FUNCTION_NAME_EXIT
    return -1;
}

//Function to set the slice mode for video encoder output port
status_t OMXEncoder::setEncoderOutputSlice(OMX_U32 nHeight, OMX_U32 nWidth, OMX_U32 sizeBytes, OMX_U32 sizeMB) {
    status_t err = 0;

    MY_LOGV("Setting Video Output Slice Mode Size in Bytes:%d, Size in MB:%d\n",sizeBytes, sizeMB);

    if ((!sizeBytes) && (!sizeMB)) {
        //Enc o/p slice not set
        return err;
    }

    if (sizeBytes) {

        if (nWidth <= 320) {
            LOGD ("Setting the Video Encoder output slice mode NOT supported for given Resolution(width should be > 320)\n");
            return err;
        }

        if (sizeBytes < 256) {
            LOGD ("Slice size provided for Video Encoder output port too small, should be atleast 256 bytes\n");
            return err;
        }

        OMX_VIDEO_CONFIG_SLICECODINGTYPE slicetype;
        INIT_OMX_STRUCT(&slicetype, OMX_VIDEO_CONFIG_SLICECODINGTYPE);
        slicetype.nPortIndex = OUTPUT_PORT;

        err = mOMX->getConfig(
                mNode, (OMX_INDEXTYPE)OMX_TI_IndexConfigSliceSettings, &slicetype, sizeof(slicetype));
        if (err != OK) {
            LOGD("get OMX_TI_IndexConfigSliceSettings failed : 0x%x", err);
            return -1;
        }

        slicetype.eSliceMode = OMX_VIDEO_SLICEMODE_AVCByteSlice;
        slicetype.nSlicesize = sizeBytes;

        err = mOMX->setConfig(
                mNode, (OMX_INDEXTYPE)OMX_TI_IndexConfigSliceSettings, &slicetype, sizeof(slicetype));
        if (err != OK) {
            LOGD("set OMX_TI_IndexConfigSliceSettings OMX_VIDEO_SLICEMODE_AVCByteSlice failed : 0x%x", err);
            return -1;
        }

    } else if (sizeMB) {

        if (sizeMB <= 6) {
            LOGD ("Macro Block set for the Video Encoder output slice mode NOT supported (very low should be > 6) \n");
            return err;
        }

        /* Max # of MB
           1080p=8160
           720p=3600
           VGA=1200
        */
        if (sizeMB > (((nWidth+15)>> 4) * ((nHeight+15)>> 4))) {
            LOGD ("Macro Block set for the Video Encoder output slice mode is too large, should be less then \
                    (((PreviewWidth+15)>> 4) * ((PreviewHeight+15)>> 4)) \n");
            return err;
        }

        OMX_VIDEO_CONFIG_SLICECODINGTYPE slicetype;
        INIT_OMX_STRUCT(&slicetype, OMX_VIDEO_CONFIG_SLICECODINGTYPE);
        slicetype.nPortIndex = OUTPUT_PORT;

        err = mOMX->getConfig(
                mNode, (OMX_INDEXTYPE)OMX_TI_IndexConfigSliceSettings, &slicetype, sizeof(slicetype));
        if (err != OK) {
            LOGD("get OMX_TI_IndexConfigSliceSettings failed : 0x%x", err);
            return -1;
        }

        slicetype.eSliceMode = OMX_VIDEO_SLICEMODE_AVCMBSlice;
        slicetype.nSlicesize = sizeMB;

        err = mOMX->setConfig(
                mNode, (OMX_INDEXTYPE)OMX_TI_IndexConfigSliceSettings, &slicetype, sizeof(slicetype));
        if (err != OK) {
            LOGD("set OMX_TI_IndexConfigSliceSettings OMX_VIDEO_SLICEMODE_AVCMBSlice failed : 0x%x", err);
            return -1;
        }

    }

    /* Other limitations:
       - Input content type should be progressive (currently nPFrames = 0 by default)
       - Changing parameters at run time will not have effect until next I-frame (hence setting IDR frame forcefully below)
       - Incase of doing the initial setting of nPFrames = 0 (only initial frame is I-frame and all others P-frames),
         you must request an I-frame to the codec after you have set nSlicesize to see your changes take place.
    */

