STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXEncoder.cpp
    MY_LOGV ("Insert IDR frame for the Encoder o/p slice mode setting to get effective \n");
    //Insert IDR frame for the setting to get effective
    OMX_CONFIG_INTRAREFRESHVOPTYPE voptype;
    INIT_OMX_STRUCT(&voptype, OMX_CONFIG_INTRAREFRESHVOPTYPE);
    voptype.nPortIndex = OUTPUT_PORT;

    err = mOMX->getConfig(
            mNode, OMX_IndexConfigVideoIntraVOPRefresh, &voptype, sizeof(voptype));
    if (err != OK) {
        LOGD("get OMX_IndexConfigVideoIntraVOPRefresh failed : %d", err);
        return -1;
    }

    voptype.IntraRefreshVOP = OMX_TRUE;
    err = mOMX->setConfig(
            mNode, OMX_IndexConfigVideoIntraVOPRefresh, &voptype, sizeof(voptype));
    if (err != OK) {
        LOGD("set OMX_IndexConfigVideoIntraVOPRefresh failed : %d", err);
        return -1;
    }

    MY_LOGV("Insert IDR Frame DONE!!!, Setting Video Output Slice Mode\n");
    return err;
}



void OMXEncoder::setCallback(EncodedBufferCallback fp) {
    mEncodedBufferCallback = fp;
    mCallbackSet = true;
}

status_t OMXEncoder::changeFrameRate(int framerate) {
    LOGV("setConfigVideoFrameRate: %d", frameRate);
    OMX_CONFIG_FRAMERATETYPE framerateType;
    INIT_OMX_STRUCT(&framerateType, OMX_CONFIG_FRAMERATETYPE);
    framerateType.nPortIndex = INPUT_PORT;

    status_t err = mOMX->getConfig(
            mNode, OMX_IndexConfigVideoFramerate,
            &framerateType, sizeof(framerateType));
    if (err != OK) {
        return BAD_VALUE;
    }

    framerateType.xEncodeFramerate = framerate << 16;
    err = mOMX->setConfig(mNode, OMX_IndexConfigVideoFramerate, &framerateType, sizeof(framerateType));
    if (err != OK) {
        return BAD_VALUE;
    }
    return OK;
}

status_t OMXEncoder::changeBitRate(int bitrate) {
    OMX_VIDEO_CONFIG_BITRATETYPE bitrateType;
    INIT_OMX_STRUCT(&bitrateType,OMX_VIDEO_CONFIG_BITRATETYPE);
    bitrateType.nPortIndex = OUTPUT_PORT;
    status_t err = mOMX->getConfig(mNode, OMX_IndexConfigVideoBitrate, &bitrateType, sizeof(bitrateType));
    if (err != OMX_ErrorNone) {
      LOGE("get OMX_IndexConfigVideoBitrate failed err:%X", err);
      return err;
    }

    LOGD("\nSet encoder bitrate to %d.\n\n", bitrate);
    bitrateType.nEncodeBitrate = bitrate;
    err = mOMX->setConfig(mNode, OMX_IndexConfigVideoBitrate, &bitrateType, sizeof(bitrateType));
    if (err != OMX_ErrorNone) {
      LOGE("set OMX_IndexConfigVideoBitrate failed error:%x", err);
      return err;
    }

    return OK;
}

#ifdef NO_MEMCOPY
status_t OMXEncoder::allocateOutputBuffer() {
    //USE_ION_BUFFERS_ALLOCATED_BY_DOMX

    int ion_fd = ion_open();
    if(ion_fd == 0) {
        LOGE("ion_open failed!!!");
        return -1;
    }

    struct ion_handle *importedHandle = NULL;

    for (OMX_U32 i = 0; i < tOutPortDef.nBufferCountActual; ++i) {

        IOMX::buffer_id buffer;
        void *pBuffer;
        err = mOMX->allocateBuffer(mNode, OUTPUT_PORT, tOutPortDef.nBufferSize, &buffer, &pBuffer);
        if (err != OK) {
            LOGD("OMX_UseBuffer for output port index:%d failed:%d",(int)i,err);
            mBufferInfo[OUTPUT_PORT][i].mBufferHdr = NULL;
        }

        OMX_TI_ION_SHARE_FD shareFDParam;
        INIT_OMX_STRUCT(&shareFDParam, OMX_TI_ION_SHARE_FD);
        shareFDParam.nPortIndex = OUTPUT_PORT;
        shareFDParam.nBufferIndex = i;
        err = mOMX->getParameter(mNode, (OMX_INDEXTYPE)OMX_TI_IndexIONBufferShareHandle, (void*)&shareFDParam, sizeof(shareFDParam));
        if (err != OK) {
            LOGD("get OMX_TI_IndexIONBufferShareHandle Error:%d", err);
            return -1;
        }
        LOGD("ENC SHARE FD = %d", shareFDParam.nShareFD);

        OMX_U32 nSize = (tOutPortDef.nBufferSize + LINUX_PAGE_SIZE - 1) & ~(LINUX_PAGE_SIZE - 1);

        err = ion_import(ion_fd, shareFDParam.nShareFD, &importedHandle);
        if (err != OK) {
            LOGD("ion_import failed. ret = %d", err);
            return -1;
        }
        LOGD("IMPORT SUCCEEDED");

        int mmap_fd;
        void *pIONBuffer;
        err = ion_map(ion_fd, importedHandle, nSize, PROT_READ | PROT_WRITE, MAP_SHARED, 0, (unsigned char**)&pIONBuffer, &mmap_fd);
        if (err) {
            LOGE("\n\n$$$$$$$$$$$$$$$$ Userspace mapping of ION buffers returned error %d\n\n", err);
            err = ion_free(ion_fd, h);
            if (err) LOGE("\n ion_free failed err=%d.\n\n%s\n\n", err, strerror(errno));
            return -1;
        }
        // TODO: More work needs to be done here.. This is just a skeleton for the moment.
    }

    return OK;
}

#endif


